# Hola &#x1F600;,

Soy **Hesus Garcia** ‚Äì **"Soy el √∫nico Hesus que conoces (y probablemente conocer√°s) üåü"** ‚Äì S√≠, como "Jes√∫s", pero con una H que me hace √∫nico. Puede sonar raro, pero cr√©eme, ¬°no lo olvidar√°s! Como tu revisor en Triple-Ten, estoy aqu√≠ para guiarte y ayudarte a mejorar tu c√≥digo. Si algo necesita un ajuste, no hay de qu√© preocuparse; ¬°aqu√≠ estoy para hacer que tu trabajo brille con todo su potencial! ‚ú®

Cada vez que encuentre un detalle importante en tu c√≥digo, te lo se√±alar√© para que puedas corregirlo y as√≠ te prepares para un ambiente de trabajo real, donde el l√≠der de tu equipo actuar√≠a de manera similar. Si en alg√∫n momento no logras solucionar el problema, te dar√© m√°s detalles para ayudarte en nuestra pr√≥xima oportunidad de revisi√≥n.

Es importante que cuando encuentres un comentario, **no los muevas, no los modifiques, ni los borres**.

---

### Formato de Comentarios

Revisar√© cuidadosamente cada implementaci√≥n en tu notebook para asegurar que cumpla con los requisitos y te dar√© comentarios de acuerdo al siguiente formato:


<div class="alert alert-block alert-success">
<b>Comentario del revisor</b> <a class="tocSkip"></a><br>
    
<b>√âxito</b> - ¬°Excelente trabajo! Esta parte est√° bien implementada y contribuye significativamente al an√°lisis de datos o al proyecto. Contin√∫a aplicando estas buenas pr√°cticas en futuras secciones.
    
</div>

<div class="alert alert-block alert-warning">
<b>Comentario del revisor</b> <a class="tocSkip"></a><br>
    
<b>Atenci√≥n</b> ‚ö†Ô∏è - Este c√≥digo est√° correcto, pero se puede optimizar. Considera implementar mejoras para que sea m√°s eficiente y f√°cil de leer. Esto fortalecer√° la calidad de tu proyecto.
    
</div>

<div class="alert alert-block alert-danger">
<b>Comentario del revisor</b> <a class="tocSkip"></a><br>
    
<b>A resolver</b> ‚ùó - Aqu√≠ hay un problema o error en el c√≥digo que es necesario corregir para aprobar esta secci√≥n. Por favor, revisa y corrige este punto, ya que es fundamental para la validez del an√°lisis y la precisi√≥n de los resultados.
    
</div>

---

Al final de cada revisi√≥n, recibir√°s un **Comentario General del Revisor** que incluir√°:

- **Aspectos positivos:** Un resumen de los puntos fuertes de tu proyecto.
- **√Åreas de mejora:** Sugerencias sobre aspectos donde puedes mejorar.
- **Temas adicionales para investigar:** Ideas de temas opcionales que puedes explorar por tu cuenta para desarrollar a√∫n m√°s tus habilidades.

Estos temas adicionales no son obligatorios en esta etapa, pero pueden serte √∫tiles para profundizar en el futuro.

---


Esta estructura en vi√±etas facilita la lectura y comprensi√≥n de cada parte del comentario final.

Tambi√©n puedes responderme de la siguiente manera si tienes alguna duda o quieres aclarar algo espec√≠fico:


<div class="alert alert-block alert-info">
<b>Respuesta del estudiante</b> <a class="tocSkip"></a>
    
Aqu√≠ puedes escribir tu respuesta o pregunta sobre el comentario.
    
</div>


**¬°Empecemos!** &#x1F680;

In [10]:
# Importar librer√≠as
import pandas as pd
from sqlalchemy import create_engine

# Configuraci√≥n de la base de datos
db_config = {
    'user': 'practicum_student',  # username
    'pwd': 'QnmDH8Sc2TQLvy2G3Vvh7',  # password
    'host': 'yp-trainers-practicum.cluster-czs0gxyx2d8w.us-east-1.rds.amazonaws.com',
    'port': 5432,  # puerto
    'db': 'data-analyst-final-project-db'  # nombre de la base de datos
}

# Cadena de conexi√≥n
connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(
    db_config['user'],
    db_config['pwd'],
    db_config['host'],
    db_config['port'],
    db_config['db']
)

# Crear motor de conexi√≥n
engine = create_engine(connection_string, connect_args={'sslmode': 'require'})

# Probar la conexi√≥n con una consulta sencilla
pd.io.sql.read_sql("SELECT 1;", con=engine)

   ?column?
0         1

In [14]:
pd.read_sql("SELECT * FROM books LIMIT 5;", con=engine)

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

In [15]:
pd.read_sql("SELECT * FROM authors LIMIT 5;", con=engine)

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

In [16]:
pd.read_sql("SELECT * FROM publishers LIMIT 5;", con=engine)

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

In [17]:
pd.read_sql("SELECT * FROM ratings LIMIT 5;", con=engine)

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

In [18]:
pd.read_sql("SELECT * FROM reviews LIMIT 5;", con=engine)

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

<div class="alert alert-block alert-success">
<b>Comentario del revisor</b> <a class="tocSkip"></a><br><b>√âxito</b>-    
Muy buen comienzo: la conexi√≥n a la base de datos est√° implementada con precisi√≥n y las consultas iniciales muestran un manejo adecuado del entorno y de las tablas disponibles. Tu avance demuestra solidez.
</div>

## Encuentra el n√∫mero de libros publicados despu√©s del 1 de enero de 2000.

In [22]:
import pandas as pd

In [24]:
query_1 = """
SELECT COUNT(*) AS books_after_2000
FROM books
WHERE publication_date > '2000-01-01';
"""

pd.read_sql(query_1, con=engine)

   books_after_2000
0               819

There are 819 books published after January 1, 2000.
This shows that a large part of the catalog is made up of recent books, which helps understand modern reading trends.

<div class="alert alert-block alert-success">
<b>Comentario del revisor</b> <a class="tocSkip"></a><br><b>√âxito</b>-   
Has formulado la consulta de manera clara y efectiva, obteniendo el dato requerido y acompa√±√°ndolo con una interpretaci√≥n precisa que aporta valor al an√°lisis general.
</div>

## Encuentra el n√∫mero de rese√±as de usuarios y la calificaci√≥n promedio para cada libro.

In [25]:
query_2 = """
SELECT 
    b.book_id,
    b.title,
    COUNT(DISTINCT rv.review_id) AS total_reviews,
    AVG(rt.rating) AS avg_rating
FROM books b
LEFT JOIN reviews rv ON b.book_id = rv.book_id
LEFT JOIN ratings rt ON b.book_id = rt.book_id
GROUP BY b.book_id, b.title
ORDER BY avg_rating DESC;
"""

df_book_reviews_ratings = pd.read_sql(query_2, con=engine)
df_book_reviews_ratings

,book_id,title,total_reviews,avg_rating
0,86,Arrows of the Queen (Heralds of Valdemar #1),2,5.00
1,901,The Walking Dead Book One (The Walking Dead #...,2,5.00
2,390,Light in August,2,5.00
3,972,Wherever You Go There You Are: Mindfulness Me...,2,5.00
4,136,Captivating: Unveiling the Mystery of a Woman'...,2,5.00
...,...,...,...,...
995,915,The World Is Flat: A Brief History of the Twen...,3,2.25
996,316,His Excellency: George Washington,2,2.00
997,202,Drowning Ruth,3,2.00
998,371,Junky,2,2.00
999,303,Harvesting the Heart,2,1.50

Most books have 2‚Äì3 reviews, with average ratings ranging from 1.5 to 5.0.
This shows that while many books are rated, there are few written reviews per book.
Books with higher average ratings could be recommended or highlighted.

<div class="alert alert-block alert-success">
<b>Comentario del revisor</b> <a class="tocSkip"></a><br><b>√âxito</b>-    
Has logrado una consulta bien estructurada que combina rese√±as y calificaciones de forma coherente, y la interpretaci√≥n que a√±ades aporta una lectura √∫til del comportamiento de los usuarios.
</div>

## Identifica la editorial que ha publicado el mayor n√∫mero de libros con m√°s de 50 p√°ginas

In [26]:
query_3 = """
SELECT 
    p.publisher,
    COUNT(*) AS total_books
FROM books b
JOIN publishers p ON b.publisher_id = p.publisher_id
WHERE b.num_pages > 50
GROUP BY p.publisher
ORDER BY total_books DESC
LIMIT 1;
"""

df_top_publisher = pd.read_sql(query_3, con=engine)
df_top_publisher

       publisher  total_books
0  Penguin Books           42

Penguin Books has published the most substantial books over 50 pages, with 42 titles.
This suggests Penguin is a leading publisher and its books could be prioritized for quality analysis or recommendations.

<div class="alert alert-block alert-success">
<b>Comentario del revisor</b> <a class="tocSkip"></a><br>
<b>√âxito</b> ‚Äì Presentas una consulta precisa y bien enfocada para identificar a la editorial con mayor producci√≥n de libros extensos, mostrando dominio en el uso de filtros y agregaciones para extraer conclusiones relevantes.
</div>

## Identifica al autor que tiene la m√°s alta calificaci√≥n promedio del libro: mira solo los libros con al menos 50 calificaciones.

In [29]:
query_4 = """
WITH book_ratings AS (
    SELECT
        b.book_id,
        b.author_id,
        COUNT(r.rating) AS num_ratings,
        AVG(r.rating) AS avg_rating
    FROM books b
    JOIN ratings r ON b.book_id = r.book_id
    GROUP BY b.book_id, b.author_id
    HAVING COUNT(r.rating) >= 50
)
SELECT 
    a.author,
    AVG(br.avg_rating) AS author_avg_rating
FROM book_ratings br
JOIN authors a ON br.author_id = a.author_id
GROUP BY a.author
ORDER BY author_avg_rating DESC
LIMIT 1;
"""

df_top_author = pd.read_sql(query_4, con=engine)
df_top_author

                       author  author_avg_rating
0  J.K. Rowling/Mary GrandPr√©           4.283844

The author with the highest average rating is J.K. Rowling/Mary GrandPr√©, with 4.28 (for books with at least 50 ratings).
This shows their work is consistently well-received and could be highlighted for recommendations or engagement.

<div class="alert alert-block alert-success">
<b>Comentario del revisor</b> <a class="tocSkip"></a><br>
<b>√âxito</b> ‚Äì Tu consulta demuestra un manejo seguro de CTEs y condiciones avanzadas, logrando identificar al autor mejor valorado con criterios s√≥lidos y bien aplicados.
</div>

## Encuentra el n√∫mero promedio de rese√±as de texto entre los usuarios que calificaron m√°s de 50 libros.

In [30]:
query_5 = """
WITH active_users AS (
    SELECT username
    FROM ratings
    GROUP BY username
    HAVING COUNT(*) > 50
),
user_review_counts AS (
    SELECT 
        au.username,
        COUNT(rv.review_id) AS review_count
    FROM active_users au
    LEFT JOIN reviews rv ON au.username = rv.username
    GROUP BY au.username
)
SELECT AVG(review_count) AS avg_reviews_per_active_user
FROM user_review_counts;
"""

df_avg_reviews = pd.read_sql(query_5, con=engine)
df_avg_reviews

   avg_reviews_per_active_user
0                    24.333333

Users who rated over 50 books write an average of 24.33 reviews.
This shows they are very active, and their opinions could be key for recommendations or analyzing reading trends.

<div class="alert alert-block alert-success">
<b>Comentario del revisor</b> <a class="tocSkip"></a><br>
<b>√âxito</b> ‚Äì Resolviste la consulta con claridad usando CTEs para segmentar usuarios activos y calcular promedios, mostrando un buen criterio para analizar comportamientos dentro de la base de datos.
</div>

# Comentario General del Revisor

<div class="alert alert-block alert-success">  
<b>Comentario del revisor</b> <a class="tocSkip"></a> 

    
Has desarrollado un proyecto con un enfoque t√©cnico s√≥lido, y por ello este comentario final se organiza **por etapas del proceso anal√≠tico**, destacando c√≥mo cada fase fue abordada con claridad.

### Preparaci√≥n y conexi√≥n a los datos

Mostraste un manejo seguro al construir la cadena de conexi√≥n y validar el acceso a la base de datos. La verificaci√≥n inicial con consultas simples refleja un control adecuado del entorno antes de profundizar en el an√°lisis.

### Exploraci√≥n y consultas fundamentales

Tus primeras consultas revelan una lectura cuidadosa de la estructura de las tablas y una correcta utilizaci√≥n de filtros, agregaciones y uniones. Cada resultado estuvo acompa√±ado de una breve interpretaci√≥n, lo cual enriquece el contexto del an√°lisis.

### An√°lisis profundo y uso de t√©cnicas avanzadas

Utilizaste CTEs de forma pertinente para segmentar usuarios, calificaciones y caracter√≠sticas de libros. Este tipo de construcci√≥n muestra que comprendes c√≥mo descomponer problemas complejos en pasos ordenados.

### Interpretaci√≥n final

Cada salida fue explicada con naturalidad y con un enfoque anal√≠tico que conecta los resultados con posibles implicaciones sobre comportamiento lector y tendencias editoriales. Esto aporta valor m√°s all√° del c√°lculo t√©cnico.

Tu proyecto est√° **aprobado**. El trabajo evidencia comprensi√≥n, precisi√≥n y un estilo de an√°lisis consistente. Contin√∫a cultivando esta claridad t√©cnica y anal√≠tica en futuras pr√°cticas.

</div>